package com.charmings.app.data

import com.charmings.app.data.model.Pet
import com.charmings.app.data.model.Requirement

// Pets 0-20
val pets1: List<Pet> = listOf(
    Pet(0, "Ось", "Ваш провідник в світі чарівного.", "Привіт! Мене звуть Ось. Я завжди був зачарований світом людей, тож вирішив, що хочу бути твоїм другом.", "image_00", "Чарівнятко, яке з'являється першим.", 1.0, listOf(Requirement(steps = 0))),
    Pet(1, "Шапинка", "Одна з найдопитливіших представниць грибного царства.", "Доброго дня! Я рада зустрітися з вами.", "image_01", "Прогулюйтесь протягом 30 хв в понеділок.", 1.0, listOf(Requirement(steps = 2000, day = "monday"))),
    Pet(2, "Злата", "Є символом оптимізму та натхнення для всіх, хто її чує.", "Привіт! Як я люблю вівторки!", "image_02", "Прогулюйтесь протягом 30 хв у вівторок.", 1.0, listOf(Requirement(steps = 2000, day = "tuesday"))),
    Pet(3, "М'яколапка", "Дуже хоче допомогти гостям знайти нових друзів.", "Добрий день, люб'язний гостю!", "image_03", "Прогулюйтесь протягом 30 хв в середу.", 1.0, listOf(Requirement(steps = 2000, day = "wednesday"))),
    Pet(4, "Чотирилапко", "Не соромиться хвалитися своїми досягненнями.", "Вітаю, любий друже!", "image_04", "Прогулюйтесь протягом 30 хв в четвер.", 1.0, listOf(Requirement(steps = 2000, day = "thursday"))),
    Pet(5, "Ладуся", "Одне з найдобріших чарівняток.", "Привіт, любий друже!", "image_05", "Прогулюйтесь протягом 30 хв в п'ятницю.", 1.0, listOf(Requirement(steps = 2000, day = "friday"))),
    Pet(6, "Блискотун", "Франт, любитель розваг і вечірок.", "Привіт, мій стильний друже!", "image_06", "Прогулюйтесь протягом 30 хв в суботу.", 1.0, listOf(Requirement(steps = 2000, day = "saturday"))),
    Pet(7, "Світинка", "Символ сонця, світла і добра.", "Ласкаво прошу в світло!", "image_07", "Прогулюйтесь протягом 30 хв в неділю.", 1.0, listOf(Requirement(steps = 2000, day = "sunday"))),
    Pet(8, "Хмурнятко", "Цінує глибину, таємничість і красу темної прози.", "У мороці темряви...", "image_08", "Прогулюйтесь протягом 30 хв у найпохмуріші години.", 1.0, listOf(Requirement(steps = 2000, month = listOf("october", "november", "december"), time = listOf(17, 23)))),
    Pet(9, "Веврик", "Знає, як сказати 'Добридень' на десяти мовах.", "Добридень!", "image_09", "Прогулюйтесь протягом 30 хв в січні.", 1.0, listOf(Requirement(steps = 2000, month = listOf("january")))),
    Pet(10, "Цвірінька", "Схильна до філософії.", "Привіт!", "image_10", "Прогулюйтесь протягом 30 хв в лютому.", 1.0, listOf(Requirement(steps = 2000, month = listOf("february")))),
    Pet(11, "Весняшка", "З'являтися тільки тим, хто має добре серце.", "Привіт!", "image_11", "Прогулюйтесь протягом 30 хв в березні.", 1.0, listOf(Requirement(steps = 2000, month = listOf("march")))),
    Pet(12, "Квітуня", "Хоче знати все про співрозмовників.", "Привіт, я Квітуня!", "image_12", "Прогулюйтесь протягом 30 хв в квітні.", 1.0, listOf(Requirement(steps = 2000, month = listOf("april")))),
    Pet(13, "Міліла", "Постійно поглинута своїми ідеями.", "Привіт!", "image_13", "Прогулюйтесь протягом 30 хв в травні.", 1.0, listOf(Requirement(steps = 2000, month = listOf("may")))),
    Pet(14, "Трускавка", "Її експерименти з кулінарією виходять за межі.", "Привіт!", "image_14", "Прогулюйтесь протягом 30 хв в червні.", 1.0, listOf(Requirement(steps = 2000, month = listOf("june")))),
    Pet(15, "Медуся", "Краще її нічого не питати про мед...", "Липовий цвіт - моя слабкість!", "image_15", "Прогулюйтесь протягом 30 хв в липні.", 1.0, listOf(Requirement(steps = 2000, month = listOf("july")))),
    Pet(16, "Злакун", "М'який характер і внутрішня сила.", "Здрастуй!", "image_16", "Прогулюйтесь протягом 30 хв в серпні.", 1.0, listOf(Requirement(steps = 2000, month = listOf("august")))),
    Pet(17, "Вереснавка", "Ніхто не знає чого вона хоче досягти.", "Здравствуйте.", "image_17", "Прогулюйтесь протягом 30 хв у вересні.", 1.0, listOf(Requirement(steps = 2000, month = listOf("september")))),
    Pet(18, "Лиско", "Без коментарів.", "Коли листя починає опадати...", "image_18", "Прогулюйтесь протягом 30 хв в жовтні.", 1.0, listOf(Requirement(steps = 2000, month = listOf("october")))),
    Pet(19, "Падолист", "Спокійний і меланхолійний.", "Моє листя колись було частиною дерев...", "image_19", "Прогулюйтесь протягом 30 хв в листопаді.", 1.0, listOf(Requirement(steps = 2000, month = listOf("november")))),
    Pet(20, "Пухокрил", "Безтурботний любитель моркви.", "Доброго дня!", "image_20", "Прогулюйтесь протягом 30 хв в грудні.", 1.0, listOf(Requirement(steps = 2000, month = listOf("december"))))
)
